## 1. Installation
Ensure you have Python installed. You can install Tabulate with the following command:
```bash
pip install tabulate
```

In [1]:
from tabulate import tabulate
import pandas as pd
import numpy as np

## 2. Basic Table Display

In [2]:
# Creating a simple table
table = [["Name", "Age", "City"],
         ["John", 28, "New York"],
         ["Anna", 22, "Paris"],
         ["Peter", 34, "Berlin"],
         ["Linda", 42, "London"]]

print(tabulate(table, headers="firstrow"))

Name      Age  City
------  -----  --------
John       28  New York
Anna       22  Paris
Peter      34  Berlin
Linda      42  London

## 3. Table Formats

In [3]:
# Displaying table in different formats
print(tabulate(table, headers="firstrow", tablefmt="grid"))
print()
print(tabulate(table, headers="firstrow", tablefmt="pipe"))
print()
print(tabulate(table, headers="firstrow", tablefmt="html"))

+--------+-------+----------+
| Name   |   Age | City     |
+========+=======+==========+
| John   |    28 | New York |
+--------+-------+----------+
| Anna   |    22 | Paris    |
+--------+-------+----------+
| Peter  |    34 | Berlin   |
+--------+-------+----------+
| Linda  |    42 | London   |
+--------+-------+----------+

| Name   |   Age | City     |
|:-------|------:|:---------|
| John   |    28 | New York |
| Anna   |    22 | Paris    |
| Peter  |    34 | Berlin   |
| Linda  |    42 | London   |

<table>
<thead>
<tr><th>Name  </th><th style="text-align: right;">  Age</th><th>City    </th></tr>
</thead>
<tbody>
<tr><td>John  </td><td style="text-align: right;">   28</td><td>New York</td></tr>
<tr><td>Anna  </td><td style="text-align: right;">   22</td><td>Paris   </td></tr>
<tr><td>Peter </td><td style="text-align: right;">   34</td><td>Berlin  </td></tr>
<tr><td>Linda </td><td style="text-align: right;">   42</td><td>London  </td></tr>
</tbody>
</table>

## 4. Displaying DataFrames

In [4]:
# Creating a DataFrame
data = {'Name': ['John', 'Anna', 'Peter', 'Linda'],
        'Age': [28, 22, 34, 42],
        'City': ['New York', 'Paris', 'Berlin', 'London']}
df = pd.DataFrame(data)

# Displaying DataFrame as a table
print(tabulate(df, headers="keys", tablefmt="grid"))

+----+--------+-------+----------+
|    | Name   |   Age | City     |
+====+========+=======+==========+
|  0 | John   |    28 | New York |
+----+--------+-------+----------+
|  1 | Anna   |    22 | Paris    |
+----+--------+-------+----------+
|  2 | Peter  |    34 | Berlin   |
+----+--------+-------+----------+
|  3 | Linda  |    42 | London   |
+----+--------+-------+----------+

## 5. Customizing Table Appearance

In [5]:
# Customizing table appearance with alignment
table = [["Name", "Age", "City"],
         ["John", 28, "New York"],
         ["Anna", 22, "Paris"],
         ["Peter", 34, "Berlin"],
         ["Linda", 42, "London"]]

print(tabulate(table, headers="firstrow", tablefmt="grid", stralign="center", numalign="right"))

+--------+-------+----------+
|  Name  |   Age |   City   |
+========+=======+==========+
|  John  |    28 | New York |
+--------+-------+----------+
|  Anna  |    22 |  Paris   |
+--------+-------+----------+
| Peter  |    34 |  Berlin  |
+--------+-------+----------+
| Linda  |    42 |  London  |
+--------+-------+----------+

## 6. Table with Aggregated Data

In [6]:
# Creating a DataFrame with aggregated data
data = {'Category': ['A', 'B', 'A', 'B'],
        'Values': [10, 20, 15, 25]}
df = pd.DataFrame(data)

# Aggregating data
aggregated_data = df.groupby('Category').sum().reset_index()

# Displaying aggregated data as a table
print(tabulate(aggregated_data, headers="keys", tablefmt="grid"))

+----+------------+----------+
|    | Category   |   Values |
+====+============+==========+
|  0 | A          |       25 |
+----+------------+----------+
|  1 | B          |       45 |
+----+------------+----------+

## 7. Tables with Calculated Columns

In [7]:
# Creating a DataFrame with calculated columns
data = {'Product': ['A', 'B', 'C', 'D'],
        'Price': [10.5, 20.0, 15.75, 25.0],
        'Quantity': [2, 1, 5, 3]}
df = pd.DataFrame(data)
df['Total'] = df['Price'] * df['Quantity']

# Displaying DataFrame with calculated columns as a table
print(tabulate(df, headers="keys", tablefmt="grid"))

+----+-----------+---------+------------+---------+
|    | Product   |   Price |   Quantity |   Total |
+====+===========+=========+============+=========+
|  0 | A         |   10.5  |          2 |   21    |
+----+-----------+---------+------------+---------+
|  1 | B         |   20    |          1 |   20    |
+----+-----------+---------+------------+---------+
|  2 | C         |   15.75 |          5 |   78.75 |
+----+-----------+---------+------------+---------+
|  3 | D         |   25    |          3 |   75    |
+----+-----------+---------+------------+---------+